#+SETUPFILE: ~/.emacs.d/org-templates/level-0.org
#+TITLE: metaclass
#+OPTIONS: ^:nil

** 用 class 和 type 来定义类
#+BEGIN_VERSE
可以看到A0和A1都是相同的 /类对象/. 这里的 type 被称作类的类,除了我们平时用的返回对象的类型外,它还可以用来创建类.
当我们使用 =class A= 来创建一个类的时候,实际上就是调用了 type 这个方法来创建一个 /类对象/
其中第一个参数为类名.第二个参数为父类列表,第三个参数为属性列表.属性列表可以是 成员变量,也可以是成员函数.
当我们使用 type(type) 的时候可以看到返回的是: /<class 'type'>/ 也就是说,type 其实是一个类,专门用来创建类的类
#+END_VERSE
#+BEGIN_SRC python :results output
  class Father:
      pass
  class Mother:
      pass

  class A0(Father, Mother):
      name = "inmove"

      def get_name(self):
          return self.name

      def set_name(self, name):
          self.name = name

  def get_name(self):
      return self.name

  def set_name(self, name):
      self.name = name

  A1 = type("A1", (Father, Mother), {"get_name": get_name, "set_name": set_name, "name": "inmove"})

  a0 = A0()
  a1 = A1()

  print(A0, A1)

  print(a0, a1)
  a0.set_name("mei")
  a1.set_name("jiao")
  print(a0.name, a1.name)
#+END_SRC

#+RESULTS:
: <class '__main__.A0'> <class '__main__.A1'>
: <__main__.A0 object at 0x7fad16677950> <__main__.A1 object at 0x7fad16677990>
: mei jiao

** 普通的单例
#+BEGIN_SRC python :results output
  class Singleton(type):
      _instances = {}
      def __call__(cls, *args, **kargs):
          print("call Singleton __call__")
          if cls not in cls._instances:
              instance = super().__call__(*args, **kargs)
              cls._instances[cls] = instance
          return cls._instances[cls]

  # Foo = Singleton("Foo", (), ())
  class Foo(metaclass=Singleton):
      def __init__(self):
          print("Foo")

  f0 = Foo()
  f1 = Foo()
#+END_SRC

#+RESULTS:
: call Singleton __call__
: Foo
: call Singleton __call__
** 线程安全的单例
#+BEGIN_SRC python :results output
  from threading import Lock, Thread

  class SingletonMeta(type):
      _instances = {}

      _lock: Lock = Lock()
      def __call__(cls, *args, **kwargs):
          with cls._lock:
              if cls not in cls._instances:
                  instance = super().__call__(*args, **kwargs)
                  cls._instances[cls] = instance
          return cls._instances[cls]

  class Singleton(metaclass=SingletonMeta):
      value: str = None
      def __init__(self, value: str) -> None:
          self.value = value
      def some_business_logic(self):
          pass

  def test_singleton(value: str) -> None:
      singleton = Singleton(value)
      print(singleton.value)

  if __name__ == "__main__":
      process1 = Thread(target=test_singleton, args=("FOO",))
      process2 = Thread(target=test_singleton, args=("BAR",))
      process2.start()
      process1.start()
#+END_SRC

#+RESULTS:
: BAR
: BAR
